import streamlit as st
import pandas as pd
import numpy as np

# ==================================================================================
# データ準備
# ==================================================================================

# ランダムな表データ作成（ダミー）
data = np.random.rand(50,2)

# データフレーム作成
df = pd.DataFrame(data, columns=["サンプル1","サンプル2"])


# ==================================================================================
# アプリ画面デザイン
# ==================================================================================

# H1見出し
st.markdown("# グラフアプリ")

# H3見出し
st.markdown("### 表データ")

# 表データをアプリ上に表示
st.dataframe(df)
